#### Terraform Plan 📝
```hcl
module.network.data.aws_availability_zones.available: Reading...
module.network.aws_vpc.vpc: Refreshing state... [id=vpc-050dd6d041e1feabe]
module.network.aws_eip.nat_eip[0]: Refreshing state... [id=eipalloc-0501da1870c9169ce]
module.network.aws_eip.nat_eip[1]: Refreshing state... [id=eipalloc-0f51b8e5bcba753f0]
module.network.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.network.aws_internet_gateway.igw: Refreshing state... [id=igw-098f150f11eaf8c96]
module.network.aws_subnet.private[0]: Refreshing state... [id=subnet-07b40de1ab0dae75d]
module.network.aws_subnet.public[0]: Refreshing state... [id=subnet-0f3dfd49e30fc3ee4]
module.network.aws_subnet.private[1]: Refreshing state... [id=subnet-0c626b5b395b8704c]
module.network.aws_subnet.public[1]: Refreshing state... [id=subnet-044ac7d7eb43777de]
module.network.aws_route_table.public: Refreshing state... [id=rtb-0e02f64b5da53fbe0]
module.network.aws_nat_gateway.nat_gateway[0]: Refreshing state... [id=nat-0538fab165986c861]
module.network.aws_nat_gateway.nat_gateway[1]: Refreshing state... [id=nat-093f5556dd9bcc78d]
module.network.aws_network_acl.public: Refreshing state... [id=acl-0da98975f92357fd1]
module.network.aws_network_acl.private: Refreshing state... [id=acl-087c1993547420148]
module.network.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00c2001cb8aab9fc3]
module.network.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-012988d429d540d01]
module.network.aws_route_table.private[0]: Refreshing state... [id=rtb-0c5ba610d2bc2b6ba]
module.network.aws_route_table.private[1]: Refreshing state... [id=rtb-09dff0cfca2a25f8a]
module.network.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05153faa3c9302df6]
module.network.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-04e30b7fe3e55376c]
module.cluster_eks.data.aws_iam_policy.this: Reading...
module.cluster_eks.aws_iam_role.this: Refreshing state... [id=devops-cluster-role]
module.cluster_eks.data.aws_iam_policy.this: Read complete after 1s [id=arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
module.cluster_eks.aws_iam_role_policy_attachment.this: Refreshing state... [id=devops-cluster-role-20250607172107897700000008]
module.cluster_eks.aws_eks_cluster.this: Refreshing state... [id=devops-cluster]
module.cluster_eks.data.tls_certificate.this: Reading...
module.cluster_eks.data.tls_certificate.this: Read complete after 1s [id=922877a0975ad078a65b8ff11ebc47b8311945c7]
module.cluster_eks.aws_security_group_rule.this: Refreshing state... [id=sgrule-3726355650]
module.cluster_eks.aws_iam_openid_connect_provider.this: Refreshing state... [id=arn:aws:iam::017820672128:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/18C99428D1897AF26281EA1339A53381]
module.node_group.data.aws_iam_policy.cni_policy: Reading...
module.node_group.data.aws_iam_policy.ecr_policy: Reading...
module.node_group.data.aws_iam_policy.node_policy: Reading...
module.externaldns.data.aws_iam_policy_document.externaldns: Reading...
module.externaldns.data.aws_iam_policy_document.assume_role: Reading...
module.externaldns.kubernetes_namespace.externaldns: Refreshing state... [id=externaldns]
module.externaldns.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=4000068724]
module.externaldns.data.aws_iam_policy_document.externaldns: Read complete after 0s [id=1645686708]
module.node_group.data.aws_iam_policy.cni_policy: Read complete after 1s [id=arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
module.node_group.data.aws_iam_policy.ecr_policy: Read complete after 1s [id=arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
module.node_group.data.aws_iam_policy.node_policy: Read complete after 1s [id=arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-load-balancer-controller.data.aws_caller_identity.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "this" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.aws-load-balancer-controller.data.aws_region.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "this" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.aws-load-balancer-controller.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy para aws-load-balancer-controller"
      + id               = (known after apply)
      + name             = "devops-aws-load-balancer-controller"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeTrustStores",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "elasticloadbalancing:CreateAction" = [
                                  + "CreateTargetGroup",
                                  + "CreateLoadBalancer",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "devops-loadbalancer-controller"
        }
      + tags_all         = {
          + "Name"      = "devops-loadbalancer-controller"
          + "Projeto"   = "devops-devops"
          + "Terraform" = "true"
        }
    }

  # module.aws-load-balancer-controller.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "devops-loadbalancer_controller"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "devops-loadbalancer-controller-role"
        }
      + tags_all              = {
          + "Name"      = "devops-loadbalancer-controller-role"
          + "Projeto"   = "devops-devops"
          + "Terraform" = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.aws-load-balancer-controller.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "devops-loadbalancer_controller"
    }

  # module.aws-load-balancer-controller.helm_release.this will be created
  + resource "helm_release" "this" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.8.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "devops-cluster"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "defaultTags"
          + value = "{Environment=devops}"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "enableShield"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "enableWaf"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "enableWafv2"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "logLevel"
          + value = "debug"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "region"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "vpcId"
          + value = "vpc-050dd6d041e1feabe"
            # (1 unchanged attribute hidden)
        }
    }

  # module.aws-load-balancer-controller.kubernetes_service_account.this will be created
  + resource "kubernetes_service_account" "this" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/component"  = "controller"
              + "app.kubernetes.io/managed-by" = "terraform"
              + "app.kubernetes.io/name"       = "aws-load-balancer-controller"
            }
          + name             = "aws-load-balancer-controller"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.ebs_csi_driver.aws_iam_role.ebs_csi_controller will be created
  + resource "aws_iam_role" "ebs_csi_controller" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/18C99428D1897AF26281EA1339A53381:sub" = "system:serviceaccount:kube-system:ebs-csi-controller-sa"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::017820672128:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/18C99428D1897AF26281EA1339A53381"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ebs-csi-controller-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Projeto"   = "devops-devops"
          + "Terraform" = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ebs_csi_driver.aws_iam_role_policy_attachment.ebs_csi_controller will be created
  + resource "aws_iam_role_policy_attachment" "ebs_csi_controller" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = "ebs-csi-controller-role"
    }

  # module.ebs_csi_driver.helm_release.aws_ebs_csi_driver will be created
  + resource "helm_release" "aws_ebs_csi_driver" {
      + atomic                     = false
      + chart                      = "aws-ebs-csi-driver"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-ebs-csi-driver"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/aws-ebs-csi-driver"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "2.28.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "controller.serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "controller.serviceAccount.create"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
    }

  # module.externaldns.aws_iam_policy.externaldns will be created
  + resource "aws_iam_policy" "externaldns" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "devops-cluster-externaldns"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "route53:ListTagsForResource",
                          + "route53:ListResourceRecordSets",
                          + "route53:ListHostedZonesByName",
                          + "route53:ListHostedZones",
                          + "route53:GetHostedZone",
                          + "route53:ChangeResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "route53:GetChange"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:route53:::change/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Projeto"   = "devops-devops"
          + "Terraform" = "true"
        }
    }

  # module.externaldns.aws_iam_role.externaldns will be created
  + resource "aws_iam_role" "externaldns" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/18C99428D1897AF26281EA1339A53381:aud" = "sts.amazonaws.com"
                              + "oidc.eks.us-east-1.amazonaws.com/id/18C99428D1897AF26281EA1339A53381:sub" = "system:serviceaccount:externaldns:externaldns"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::017820672128:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/18C99428D1897AF26281EA1339A53381"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "devops-cluster-externaldns"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Projeto"   = "devops-devops"
          + "Terraform" = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.externaldns.aws_iam_role_policy_attachment.externaldns will be created
  + resource "aws_iam_role_policy_attachment" "externaldns" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "devops-cluster-externaldns"
    }

  # module.externaldns.helm_release.externaldns will be created
  + resource "helm_release" "externaldns" {
      + atomic                     = false
      + chart                      = "external-dns"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "externaldns"
      + namespace                  = "externaldns"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/external-dns/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.16.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "aws.region"
          + value = "us-east-1"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "domainFilters[0]"
          + value = "dtechdevops.shop"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "logLevel"
          + value = "debug"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "policy"
          + value = "sync"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "provider"
          + value = "aws"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "registry"
          + value = "txt"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "externaldns"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "txtOwnerId"
          + value = "externaldns"
            # (1 unchanged attribute hidden)
        }
    }

  # module.externaldns.kubernetes_service_account.externaldns will be created
  + resource "kubernetes_service_account" "externaldns" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "externaldns"
          + namespace        = "externaldns"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.karpenter.data.aws_caller_identity.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "this" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.karpenter.data.aws_ecrpublic_authorization_token.token will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecrpublic_authorization_token" "token" {
      + authorization_token = (sensitive value)
      + expires_at          = (known after apply)
      + id                  = (known after apply)
      + password            = (sensitive value)
      + user_name           = (known after apply)
    }

  # module.karpenter.data.aws_iam_policy.amazon_ssmmanaged_instance_core will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "amazon_ssmmanaged_instance_core" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = "AmazonSSMManagedInstanceCore"
      + path             = (known after apply)
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
    }

  # module.karpenter.data.aws_iam_policy.cni_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "cni_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = "AmazonEKS_CNI_Policy"
      + path             = (known after apply)
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
    }

  # module.karpenter.data.aws_iam_policy.ecr_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "ecr_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = "AmazonEC2ContainerRegistryReadOnly"
      + path             = (known after apply)
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
    }

  # module.karpenter.data.aws_iam_policy.node_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "node_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = "AmazonEKSWorkerNodePolicy"
      + path             = (known after apply)
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
    }

  # module.karpenter.data.aws_region.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "this" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.karpenter.data.kubernetes_config_map_v1.aws_auth will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_config_map_v1" "aws_auth" {
      + binary_data = (known after apply)
      + data        = (known after apply)
      + id          = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.karpenter.aws_ec2_tag.cluster_primary_sg_tag will be created
  + resource "aws_ec2_tag" "cluster_primary_sg_tag" {
      + id          = (known after apply)
      + key         = "karpenter.sh/discovery"
      + resource_id = "sg-0786010b1ce19f7a1"
      + value       = "devops-cluster"
    }

  # module.karpenter.aws_ec2_tag.cluster_sg_tag will be created
  + resource "aws_ec2_tag" "cluster_sg_tag" {
      + id          = (known after apply)
      + key         = "karpenter.sh/discovery"
      + resource_id = "sg-0786010b1ce19f7a1"
      + value       = "devops-cluster"
    }

  # module.karpenter.aws_iam_instance_profile.karpenter will be created
  + resource "aws_iam_instance_profile" "karpenter" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "KarpenterNodeInstanceProfile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "devops-karpenter-node-role"
      + tags_all    = {
          + "Projeto"   = "devops-devops"
          + "Terraform" = "true"
        }
      + unique_id   = (known after apply)
    }

  # module.karpenter.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "KarpenterController"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "ec2:DescribeImages",
                          + "ec2:RunInstances",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeLaunchTemplates",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeInstanceTypeOfferings",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DeleteLaunchTemplate",
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                          + "ec2:CreateLaunchTemplate",
                          + "ec2:CreateFleet",
                          + "ec2:DescribeSpotPriceHistory",
                          + "pricing:GetProducts",
                          + "iam:CreateInstanceProfile",
                          + "iam:DeleteInstanceProfile",
                          + "iam:TagInstanceProfile",
                          + "iam:AddRoleToInstanceProfile",
                          + "iam:RemoveRoleFromInstanceProfile",
                          + "iam:PassRole",
                          + "ec2:CreateSecurityGroup",
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:RequestSpotInstances",
                          + "ec2:CreateVolume",
                          + "ec2:DeleteVolume",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "Karpenter"
                    },
                  + {
                      + Action   = "ec2:DescribeInstances"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "ec2:ModifyInstanceAttribute"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DetachNetworkInterface",
                          + "ec2:DeleteNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = "ec2:TerminateInstances"
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/karpenter.sh/nodepool" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "ConditionalEC2Termination"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::423087439469:role/example-karpenter-node-role"
                      + Sid      = "PassNodeIAMRole"
                    },
                  + {
                      + Action   = "eks:DescribeCluster"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:eks:us-east-1:423087439469:cluster/example-cluster"
                      + Sid      = "EKSClusterEndpointLookup"
                    },
                  + {
                      + Action    = [
                          + "iam:CreateInstanceProfile",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/kubernetes.io/cluster/${var.cluster_name}" = "owned"
                              + "aws:RequestTag/topology.kubernetes.io/region"             = "us-east-1"
                            }
                          + StringLike   = {
                              + "aws:RequestTag/karpenter.k8s.aws/ec2nodeclass" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "AllowScopedInstanceProfileCreationActions"
                    },
                  + {
                      + Action    = [
                          + "iam:TagInstanceProfile",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/kubernetes.io/cluster/${var.cluster_name}"  = "owned"
                              + "aws:RequestTag/topology.kubernetes.io/region"              = "us-east-1"
                              + "aws:ResourceTag/kubernetes.io/cluster/${var.cluster_name}" = "owned"
                              + "aws:ResourceTag/topology.kubernetes.io/region"             = "us-east-1"
                            }
                          + StringLike   = {
                              + "aws:RequestTag/karpenter.k8s.aws/ec2nodeclass"  = "*"
                              + "aws:ResourceTag/karpenter.k8s.aws/ec2nodeclass" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "AllowScopedInstanceProfileTagActions"
                    },
                  + {
                      + Action    = [
                          + "iam:AddRoleToInstanceProfile",
                          + "iam:RemoveRoleFromInstanceProfile",
                          + "iam:DeleteInstanceProfile",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:ResourceTag/kubernetes.io/cluster/${var.cluster_name}" = "owned"
                              + "aws:ResourceTag/topology.kubernetes.io/region"             = "us-east-1"
                            }
                          + StringLike   = {
                              + "aws:ResourceTag/karpenter.k8s.aws/ec2nodeclass" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "AllowScopedInstanceProfileActions"
                    },
                  + {
                      + Action   = "iam:GetInstanceProfile"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowInstanceProfileReadActions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Projeto"   = "devops-devops"
          + "Terraform" = "true"
        }
    }

  # module.karpenter.aws_iam_role.karpenterNodeRole will be created
  + resource "aws_iam_role" "karpenterNodeRole" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "devops-karpenter-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "devops-karpenter-node-role"
        }
      + tags_all              = {
          + "Name"      = "devops-karpenter-node-role"
          + "Projeto"   = "devops-devops"
          + "Terraform" = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.karpenter.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "karpenter-controller"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "devops-karpenter-controller"
        }
      + tags_all              = {
          + "Name"      = "devops-karpenter-controller"
          + "Projeto"   = "devops-devops"
          + "Terraform" = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.karpenter.aws_iam_role_policy_attachment.amazon_ssmmanaged_instance_core will be created
  + resource "aws_iam_role_policy_attachment" "amazon_ssmmanaged_instance_core" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "devops-karpenter-node-role"
    }

  # module.karpenter.aws_iam_role_policy_attachment.cni_attach will be created
  + resource "aws_iam_role_policy_attachment" "cni_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "devops-karpenter-node-role"
    }

  # module.karpenter.aws_iam_role_policy_attachment.ecr_attach will be created
  + resource "aws_iam_role_policy_attachment" "ecr_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "devops-karpenter-node-role"
    }

  # module.karpenter.aws_iam_role_policy_attachment.node_attach will be created
  + resource "aws_iam_role_policy_attachment" "node_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "devops-karpenter-node-role"
    }

  # module.karpenter.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "karpenter-controller"
    }

  # module.karpenter.helm_release.karpenter will be created
  + resource "helm_release" "karpenter" {
      + atomic                     = false
      + chart                      = "karpenter"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "karpenter"
      + namespace                  = "karpenter"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://public.ecr.aws/karpenter"
      + repository_password        = (sensitive value)
      + repository_username        = (known after apply)
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.37.0"
      + wait                       = false
      + wait_for_jobs              = false

      + set {
          + name  = "affinity"
            # (2 unchanged attributes hidden)
        }
      + set {
          + name  = "controller.resources.limits.cpu"
          + value = "1"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "controller.resources.limits.memory"
          + value = "1Gi"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "controller.resources.requests.cpu"
          + value = "1"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "controller.resources.requests.memory"
          + value = "1Gi"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "controller.tolerations[0].key"
          + value = "karpenter.sh/nodepool"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "controller.tolerations[0].operator"
          + value = "Exists"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "create_pod_identity_association"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "enable_pod_identity"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "logLevel"
          + value = "debug"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "nodeSelector"
            # (2 unchanged attributes hidden)
        }
      + set {
          + name  = "node_iam_role_additional_policies.AmazonSSMManagedInstanceCore"
          + value = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "settings.aws.defaultInstanceProfile"
          + value = "KarpenterNodeInstanceProfile"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "settings.aws.interruptionQueueName"
          + value = "devops-cluster-karpenter"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "settings.clusterEndpoint"
          + value = "https://18C99428D1897AF26281EA1339A53381.gr7.us-east-1.eks.amazonaws.com"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "settings.clusterName"
          + value = "devops-cluster"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "tolerations[0].effect"
          + value = "NoSchedule"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "tolerations[0].key"
          + value = "CriticalAddonsOnly"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "tolerations[0].key"
          + value = "node-role.kubernetes.io/master"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "tolerations[0].operator"
          + value = "Exists"
            # (1 unchanged attribute hidden)
        }
    }

  # module.karpenter.kubectl_manifest.karpenter_example_deployment will be created
  + resource "kubectl_manifest" "karpenter_example_deployment" {
      + api_version             = "apps/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "inflate"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              name: inflate
            spec:
              replicas: 0
              selector:
                matchLabels:
                  app: inflate
              template:
                metadata:
                  labels:
                    app: inflate
                spec:
                  containers:
                  - image: public.ecr.aws/eks-distro/kubernetes/pause:3.7
                    name: inflate
                    resources:
                      requests:
                        cpu: 1
                        memory: 1.5Gi
                  terminationGracePeriodSeconds: 0
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.karpenter.kubectl_manifest.karpenter_node_class will be created
  + resource "kubectl_manifest" "karpenter_node_class" {
      + api_version             = "karpenter.k8s.aws/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "EC2NodeClass"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "default"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.k8s.aws/v1beta1
            kind: EC2NodeClass
            metadata:
              name: default
            spec:
              amiFamily: AL2
              role: devops-karpenter-node-role
              securityGroupSelectorTerms:
              - tags:
                  karpenter.sh/discovery: devops-cluster
              subnetSelectorTerms:
              - tags:
                  karpenter.sh/discovery: devops-cluster
              tags:
                karpenter.sh/discovery: devops-cluster
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.karpenter.kubectl_manifest.karpenter_node_pool will be created
  + resource "kubectl_manifest" "karpenter_node_pool" {
      + api_version             = "karpenter.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "NodePool"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "default"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.sh/v1beta1
            kind: NodePool
            metadata:
              name: default
            spec:
              disruption:
                consolidateAfter: 30s
                consolidationPolicy: WhenEmpty
              limits:
                cpu: 1000
                memory: 1000Gi
              template:
                spec:
                  nodeClassRef:
                    name: default
                  requirements:
                  - key: karpenter.k8s.aws/instance-category
                    operator: In
                    values:
                    - c
                    - m
                    - r
                    - t
                  - key: karpenter.k8s.aws/instance-cpu
                    operator: In
                    values:
                    - "2"
                    - "4"
                    - "8"
                    - "16"
                    - "32"
                  - key: karpenter.k8s.aws/instance-hypervisor
                    operator: In
                    values:
                    - nitro
                  - key: karpenter.k8s.aws/instance-generation
                    operator: Gt
                    values:
                    - "5"
                  - key: node.kubernetes.io/instance-type
                    operator: In
                    values:
                    - t3.medium
                    - t3.large
                    - c5.large
                    - m5.large
              topologySpreadConstraints:
              - labelSelector:
                  matchLabels:
                    app.kubernetes.io/instance: prometheus
                maxSkew: 1
                topologyKey: kubernetes.io/hostname
                whenUnsatisfiable: ScheduleAnyway
              weight: 1
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.karpenter.kubernetes_config_map_v1_data.aws_auth will be created
  + resource "kubernetes_config_map_v1_data" "aws_auth" {
      + data          = (known after apply)
      + field_manager = "Terraform"
      + force         = true
      + id            = (known after apply)

      + metadata {
          + name      = "aws-auth"
          + namespace = "kube-system"
        }
    }

  # module.node_group.aws_eks_node_group.this will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "devops-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "m4.xlarge",
        ]
      + node_group_name        = "devops-nodegroup"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-07b40de1ab0dae75d",
          + "subnet-0c626b5b395b8704c",
        ]
      + tags_all               = {
          + "Projeto"   = "devops-devops"
          + "Terraform" = "true"
        }
      + version                = "1.32"

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.node_group.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "devops-node-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "devops-node-group-role"
        }
      + tags_all              = {
          + "Name"      = "devops-node-group-role"
          + "Projeto"   = "devops-devops"
          + "Terraform" = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.node_group.aws_iam_role_policy_attachment.cni_attach will be created
  + resource "aws_iam_role_policy_attachment" "cni_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "devops-node-group-role"
    }

  # module.node_group.aws_iam_role_policy_attachment.ecr_attach will be created
  + resource "aws_iam_role_policy_attachment" "ecr_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "devops-node-group-role"
    }

  # module.node_group.aws_iam_role_policy_attachment.node_attach will be created
  + resource "aws_iam_role_policy_attachment" "node_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "devops-node-group-role"
    }

Plan: 34 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
